###############################################################################
# Created by write_sdc
###############################################################################
current_design dsm_and_freq_divider
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name sclk -period 10.0000 [get_ports {sclk}]
set_propagated_clock [get_clocks {sclk}]
create_clock -name freq_in -period 0.3330 [get_ports {freq_in}]
set_propagated_clock [get_clocks {freq_in}]
set_clock_groups -name group1 -asynchronous \
 -group [get_clocks {freq_in}]\
 -group [get_clocks {sclk}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
